<?php $my_query = new WP_Query( array( 
	/*
		按照分类目录的编号查询该分类目录下的所有文章信息
		'cat'	代表想要通过分类目录的编号获取指定分类目录下的所有文章信息，对应的值是你想要获取的分类目录的编号
		示例代码：
		'cat'					=>		3
	*/

	/*
		按照分类目录的别名查询该分类目录下的所有文章信息
		'category_name'	代表想要通过分类目录的别名来获取指定分类目录下的所有文章信息，对应的值是你想要获取的分类目录的别名
		示例代码：
		'category_name'				=>		'wangqiu'
	*/
	
	/*
		查询那些即在a（某个分类目录）中，又在b（某个分类目录）中的文章信息
		'category__and'代表想要获取既在A又在B这两个分类目录下的文章信息，对应的值是你想要获取的那两个分类目录的编号
		示例代码：
		'category__and'					=>		array(2, 3)
	*/

	/*
		查询一个或者多个分类目录下的所有文章信息
		'category__in' 代表的是想要查询一个或多个分类目录下的文章信息，对应的值是指定的分类目录的编号
		示例代码：
		'category__in'							=>		array(6, 7)
	*/
	
	/*
		查询除了某个分类目录以外的其他分类目录下的所有文章信息
		'category__not_in'	代表想要查询除了某个分类目录以外其他分类目录下的所有文章信息，对应的值是被排除在外的分类目录的编号
		示例代码：
		'category__not_in'						=>		array(6)
	*/
	
	/*
		按标签的别名查询某个标签下的所有文章信息
		'tag' 代表的就是想要同标签的别名来查询这个标签下的所有文章信息，对应的值就是指定的标签的别名
		示例代码：
		'tag'										=>		'biansi'		
	*/
	
	/*
		按标签的编号查询某个标签下的所有文章信息
		'tag_id' 代表的就是想要同标签的编号来查询这个标签下的所有文章信息，对应的值就是指定的标签的编号		
		示例代码：
		'tag_id'			=>		9

	*/
	
	/*
		查询同时在两个标签下的文章信息
		'tag__and' 代表查询同时在两个标签下的文章信息，对应的值是指定的两个标签的编号
		示例代码：
		'tag__and'			=>		array(8, 13)
	*/
	
	/*
		同时查询在一个或者多个标签下的所有文章信息（按编号）
		'tag__in'	代表同时查询一个或者多个标签下的文章信息，对应的值是指定的标签的编号
		示例代码：
		'tag__in'					=>		array(9, 14)
	*/
	
	/*
		同时查询在一个或者多个标签下的所有文章信息（按别名）
		'tag_slug__in'	代表同时查询一个或者多个标签下的文章信息，对应的值是指定的标签的别名
		示例代码：
		'tag_slug__in'					=>		array('tongdawei', 'duo')
	*/	

	/*
		查询除了某个标签以外的其他标签下的所有文章信息
		'tag__not_in'	代表想要查询排除某个标签以外其他的标签下的文章信息，对应的值是想要排除的标签的编号
		示例代码：
		'tag__not_in'				=>		array(8, 9)
	*/
	

) ); ?>

<?php if ( $my_query->have_posts() ) : while ( $my_query->have_posts() ) : $my_query->the_post(); ?>
	<h3><?php the_title(); ?></h3>
<?php endwhile; ?>
<?php endif; ?>